#+title: Graveyard

* Billing
#+begin_src elisp :var data=2022-03 year=2022 month=02 :hlines yes :exports both
;; (orgtbl-to-unicode
(orgtbl-to-orgtbl
  (add-yyyy-mm-to-table data year month)
 ;; (mapcar
 ;;  (lambda (x)
 ;;    (if (listp x)
 ;;        (progn (let ((day (nth 1 x)))
 ;;                 (setf (nth 1 x)
 ;;                       (if (integerp day)
 ;;                           (format "%4d/%02d/%02d" year month day)
 ;;                         day))) x)
 ;;      x)) data)
 nil)
#+end_src

#+RESULTS:
#+begin_example
|------------+-------------+----------+------------------------------------+-----+-------|
|          D |        Time | Project  | Task                               | Day | Hours |
|------------+-------------+----------+------------------------------------+-----+-------|
|            |             |          |                                    |     |       |
| 2022-02-01 |       10-11 | ETL      | Test stand                         | TUE |   1.0 |
| 2022-02-01 |       11-12 | ME0BE    | Firmware                           | TUE |   1.0 |
| 2022-02-01 |        12-1 | GE21     | Firmware                           | TUE |   1.0 |
| 2022-02-01 |         1-2 | GE11     | Firmware                           | TUE |   1.0 |
| 2022-02-01 |         2-3 | ADMIN    | Meet with Eric                     | TUE |   1.0 |
| 2022-02-01 |      3-3:30 | ETL      | Meet with Indara                   | TUE |   0.5 |
| 2022-02-01 |      3:30-5 | ETL      | Test stand; Firmware update        | TUE |   1.5 |
|            |             |          |                                    |     |       |
| 2022-02-02 |      7-7:30 | GE21     | Firmware                           | WED |   0.5 |
| 2022-02-02 |      7:30-8 | GE11     | Firmware                           | WED |   0.5 |
| 2022-02-02 |      8-8:30 | ETL      | MT specifications                  | WED |   0.5 |
| 2022-02-02 |     8:30-10 | --       | Break                              | WED |   1.5 |
| 2022-02-02 |       10-11 | GE11     | Firmware                           | WED |   1.0 |
| 2022-02-02 |       11-12 | GE11     | Firmware                           | WED |   1.0 |
| 2022-02-02 |    12-12:30 | ME0SF    | DPG Meeting                        | WED |   0.5 |
| 2022-02-02 |     12:30-1 | APOLLO   | Tejasava                           | WED |   0.5 |
| 2022-02-02 |         1-2 | GE21     | Firmware                           | WED |   1.0 |
| 2022-02-02 |   2:30-5:30 | ETL      | Meeting with Sergey; Group Meeting | WED |   3.0 |
|            |             |          |                                    |     |       |
| 2022-02-03 |         7-8 | GE21     | Firmware (new sorter)              | THU |   1.0 |
| 2022-02-03 |         8-9 | GE11     | Firmware (new sorter)              | THU |   1.0 |
| 2022-02-03 |        9-10 | ME0BE    | Firmware (new sorter)              | THU |   1.0 |
| 2022-02-03 |       10-11 | L0MDT    | Meeting                            | THU |   1.0 |
| 2022-02-03 |    11-12:30 | GE21     | Meeting                            | THU |   1.5 |
| 2022-02-03 |         1-2 | GE21     | Firmware (new sorter)              | THU |   1.0 |
| 2022-02-03 |         3-4 | ETL      | Test stand                         | THU |   1.0 |
| 2022-02-03 |         4-5 | ME0OH    | Meeting                            | THU |   1.0 |
|            |             |          |                                    |     |       |
| 2022-02-04 |        9-10 | VACATION | Katherine                          | FRI |   1.0 |
| 2022-02-04 |       10-11 | ADMIN    | Meet with Eric                     | FRI |   1.0 |
| 2022-02-04 |       11-12 | ETL      | Meet with Daniel                   | FRI |   1.0 |
| 2022-02-04 |        12-1 | VACATION | Katherine                          | FRI |   1.0 |
| 2022-02-04 |         1-2 | ME0SF    | Chloe                              | FRI |   1.0 |
| 2022-02-04 |         3-4 | ETL      | Meet with Daniel                   | FRI |   1.0 |
|            |             |          |                                    |     |       |
|------------+-------------+----------+------------------------------------+-----+-------|
|            |             |          |                                    |     |       |
| 2022-02-07 |         9-5 | VACATION | Katherine                          | MON |   8.0 |
|            |             |          |                                    |     |       |
| 2022-02-08 |       11-12 | ME0BE    | Firmware meeting                   | TUE |   1.0 |
| 2022-02-08 |        12-3 | ETL      | Test stand setup                   | TUE |   3.0 |
| 2022-02-08 |         3-4 | GE21     | Firmware updates                   | TUE |   1.0 |
| 2022-02-08 |         4-5 | GE11     | Firmware updates                   | TUE |   1.0 |
| 2022-02-08 |         5-6 | GE21     | Firmware updates                   | TUE |   1.0 |
| 2022-02-08 |      6-6:30 | GE11     | Firmware updates                   | TUE |   0.5 |
|            |             |          |                                    |     |       |
| 2022-02-09 |        9-10 | GE21     | Firmware                           | WED |   1.0 |
| 2022-02-09 |       10-11 | GE11     | Firmware                           | WED |   1.0 |
| 2022-02-09 |       11-12 | ETL      | Spec doc                           | WED |   1.0 |
| 2022-02-09 |         1-4 | CSC      | ODMB Review                        | WED |   3.0 |
| 2022-02-09 |         4-5 | ETL      | Firmware Update                    | WED |   2.0 |
| 2022-02-09 |         5-6 | APOLLO   | IPMC FW                            | WED |   1.0 |
|            |             |          |                                    |     |       |
| 2022-02-10 |        9-10 | ETL      | Hog updates                        | THU |   1.0 |
| 2022-02-10 |       10-11 | L0MDT    | Meeting (EE)                       | THU |   1.0 |
| 2022-02-10 |       11-12 | ETL      | Meeting (Modules)                  | THU |   1.0 |
| 2022-02-10 |      1-1:30 | ETL      | Firmware update                    | THU |   0.5 |
| 2022-02-10 |      1:30-3 | APOLLO   | Firmware update; Documentation     | THU |   1.5 |
| 2022-02-10 |         3-4 | APOLLO   | Meeting                            | THU |   1.0 |
| 2022-02-10 |         4-5 | ME0OH    | Meeting                            | THU |   1.0 |
| 2022-02-10 |      5-5:30 | APOLLO   | Firmware update                    | THU |   0.5 |
|            |             |          |                                    |     |       |
| 2022-02-11 |      9-9:30 | CSC      | ODMB Review                        | FRI |   0.5 |
| 2022-02-11 |     9:30-12 | L0MDT    | PDR Followup Meeting               | FRI |   2.5 |
| 2022-02-11 |        12-1 | --       | EDF Lunch                          | FRI |   1.0 |
| 2022-02-11 |      1-1:30 | ETL      | Test stand                         | FRI |   0.5 |
| 2022-02-11 |   1:30-3:00 | L0MDT    | PDR Answers                        | FRI |   1.0 |
| 2022-02-11 |         4-5 | GE21     | Cluster DAQ                        | FRI |   1.0 |
| 2022-02-11 |         5-6 | GE11     | Cluster DAQ                        | FRI |   1.0 |
| 2022-02-11 |         6-7 | ME0BE    | Cluster DAQ                        | FRI |   1.0 |
|            |             |          |                                    |     |       |
|------------+-------------+----------+------------------------------------+-----+-------|
|            |             |          |                                    |     |       |
| 2022-02-14 |      9-9:30 | GE11     | Cluster DAQ                        | MON |   0.5 |
| 2022-02-14 |     9:30-10 | APOLLO   | C2C wrapper generation             | MON |   0.5 |
| 2022-02-14 |       10-11 | ETL      | Specifications                     | MON |   1.0 |
| 2022-02-14 |     11:30-1 | ETL      | Meeting                            | MON |   1.5 |
| 2022-02-14 |         1-2 | L0MDT    | BU Meeting                         | MON |   1.0 |
| 2022-02-14 |         2-3 | L0MDT    | Felix meeting                      | MON |   1.0 |
| 2022-02-14 |         3-4 | APOLLO   | IPMC                               | MON |   1.0 |
| 2022-02-14 |         4-5 | ETL      | Mechanical meeting with Daniel     | MON |   1.0 |
|            |             |          |                                    |     |       |
| 2022-02-15 |        9-10 | GE21     | Hog fixes                          | TUE |   1.0 |
| 2022-02-15 |       10-11 | GE11     | Hog fixes                          | TUE |   1.0 |
| 2022-02-15 |       11-12 | ME0BE    | Firmware meeting                   | TUE |   1.0 |
| 2022-02-15 |        12-2 | --       | Indara lunch                       | TUE |   2.0 |
| 2022-02-15 |         2-4 | ETL      | Lab work with Daniel               | TUE |   2.0 |
| 2022-02-15 |         4-5 | L0MDT    | Hog fixes                          | TUE |   1.0 |
|            |             |          |                                    |     |       |
| 2022-02-16 |        9-11 | APOLLO   | IPMC Updates                       | WED |   2.0 |
| 2022-02-16 |     12:30-1 | Tracker  | Meeting                            | WED |   0.5 |
| 2022-02-16 |      2-2:30 | ETL      | BU Meeting                         | WED |   0.5 |
| 2022-02-16 |      2:30-4 | --       | Break                              | WED |   1.5 |
| 2022-02-16 |         4-5 | GE21     | Firmware                           | WED |   1.0 |
| 2022-02-16 |         4-5 | GE11     | Firmware                           | WED |   1.0 |
|            |             |          |                                    |     |       |
| 2022-02-17 |      9-9:30 | GE21     | Firmware                           | THU |   0.5 |
| 2022-02-17 |     9:30-11 | APOLLO   | EDF Meeting                        | THU |   1.5 |
| 2022-02-17 |       11-12 | L0MDT    | EE Meeting                         | THU |   1.0 |
| 2022-02-17 |    12-12:30 | GE11     | Firmware (timing)                  | THU |   0.5 |
| 2022-02-17 |     12:30-2 | ETL      | Reverse engineering documentation  | THU |   1.5 |
| 2022-02-17 |      2-2:30 | ETL      | Firmware update                    | THU |   0.5 |
| 2022-02-17 |      2:30-3 | GE11     | Firmware (timing)                  | THU |   0.5 |
| 2022-02-17 |      4-4:30 | ETL      | Programming script                 | THU |   0.5 |
| 2022-02-17 |      4:30-5 | ETL      | Mechanical meeting                 | THU |   1.0 |
|            |             |          |                                    |     |       |
| 2022-02-18 |       10-12 | APOLLO   | IPMC                               | FRI |   2.0 |
| 2022-02-18 |        12-3 | CSC      | ODMB Review                        | FRI |   3.0 |
| 2022-02-18 |         3-5 | GE11     | Firmware placement                 | FRI |   2.0 |
| 2022-02-18 |         5-7 | GE21     | Firmware placement                 | FRI |   2.0 |
|            |             |          |                                    |     |       |
|------------+-------------+----------+------------------------------------+-----+-------|
|            |             |          |                                    |     |       |
| 2022-02-21 |         9-5 | VAC      | Vacation                           | MON |   8.0 |
|            |             |          |                                    |     |       |
| 2022-02-22 |       10-11 | APOLLO   | Rev2a debug                        | TUE |   1.0 |
| 2022-02-22 |       11-12 | --       | LUNCH                              | TUE |   1.0 |
| 2022-02-22 |        12-4 | APOLLO   | Rev2a debug                        | TUE |   4.0 |
| 2022-02-24 |         4-5 | ETL      | Dataformats                        | THU |   1.0 |
| 2022-02-24 |         5-6 | ETL      | Schedule                           | THU |   1.0 |
|            |             |          |                                    |     |       |
| 2022-02-23 | 11:30-12:30 | GE21     | ISERDES placement                  | WED |   1.0 |
| 2022-02-23 |     12:30-1 | Tracker  | Meeting                            | WED |   0.5 |
| 2022-02-23 |         1-2 | APOLLO   | IPMC dongle, shipping              | WED |   1.0 |
| 2022-02-23 |         2-3 | ETL      | Firmware update                    | WED |   1.0 |
| 2022-02-23 |         3-4 | GE21     | ISERDES placement                  | WED |   1.0 |
| 2022-02-23 |         4-6 | ETL      | Meeting; test stand debug          | WED |   2.0 |
|            |             |          |                                    |     |       |
| 2022-02-24 |     9-11:30 | GE11     | MGT loopback                       | THU |   2.5 |
| 2022-02-24 | 11:30-12:30 | GE21     | DDR s-bits                         | THU |   1.0 |
| 2022-02-24 |  12:30-3:30 | APOLLO   | IPMC firmware update / test        | THU |   5.0 |
| 2022-02-24 |   3:30-5:30 | ETL      | Emulator version control           | THU |   2.0 |
|            |             |          |                                    |     |       |
| 2022-02-25 |        9-11 | APOLLO   | IPMC Firmware update               | FRI |   2.0 |
| 2022-02-25 |        11-1 | ETL      | ETROC firmware                     | FRI |   2.0 |
| 2022-02-25 |         1-2 | --       | LUNCH                              | FRI |   1.0 |
| 2022-02-25 |         2-4 | ETL      | ETROC firmware                     | FRI |   2.0 |
| 2022-02-25 |         4-5 | APOLLO   | IPMC firmware test                 | FRI |   1.0 |
|            |             |          |                                    |     |       |
|------------+-------------+----------+------------------------------------+-----+-------|
|            |             |          |                                    |     |       |
| 2022-02-28 |         9-1 | ETL      | Meeting; slides                    | MON |   4.0 |
| 2022-02-28 |         1-2 | L0MDT    | Meeting                            | MON |   1.0 |
| 2022-02-28 |         2-4 | --       | Kaitlins dog                       | MON |   2.0 |
| 2022-02-28 |      4:30-5 | ETL      | Firmware                           | MON |   0.5 |
|            |             |          |                                    |     |       |
| 2022-02-29 |      9-9:30 | ETL      | Firmware                           | TUE |   0.5 |
| 2022-02-29 |  9:30-10:30 | CSC      | ODMB Review                        | TUE |   1.0 |
| 2022-02-29 |    10:30-11 | L0MDT    | Repository                         | TUE |   0.5 |
| 2022-02-29 |    11-11:30 | GE11     | Loopback firmware                  | TUE |   0.5 |
| 2022-02-29 | 11:30-12:30 | L0MDT    | Update project generator           | TUE |   1.0 |
| 2022-02-29 |  12:30-1:00 | --       | LUNCH                              | TUE |   0.5 |
| 2022-02-29 |      1:00-3 | APOLLO   | AXI Regmap                         | TUE |   1.5 |
| 2022-02-29 |         3-4 | ADMIN    | Meet with Panos                    | TUE |   1.0 |
| 2022-02-29 |      4-4:30 | ME0SF    | Chloe                              | TUE |   0.5 |
| 2022-02-29 |      4:30-5 | APOLLO   | AXI Regmap                         | TUE |   0.5 |
| 2022-02-29 |      6:30-7 | ME0OH    | Accruals                           | TUE |   0.5 |
|            |             |          |                                    |     |       |
| 2022-02-30 |      9-2:30 | L0MDT    | Thiago visit                       | WED |   5.5 |
| 2022-02-30 |      2:30-3 | --       | Break                              | WED |   0.5 |
| 2022-02-30 |      3-4:30 | ETL      | So Young                           | WED |   1.5 |
| 2022-02-30 |         5-6 | APOLLO   | SM Gerbers; IPMC                   | WED |   1.0 |
|            |             |          |                                    |     |       |
| 2022-02-31 |      9-9:30 | --       | ??                                 | THU |   0.5 |
| 2022-02-31 |     9:30-10 | L0MDT    | Repository                         | THU |   0.5 |
| 2022-02-31 |       10-11 | L0MDT    | Meeting                            | THU |   1.0 |
| 2022-02-31 |       11-12 | ETL      | Meet with Indara                   | THU |   1.0 |
| 2022-02-31 |        12-3 | APOLLO   | Rev 1 Repair                       | THU |   2.0 |
| 2022-02-31 |         3-4 | APOLLO   | IPMC Meeting                       | THU |   1.0 |
|            |             |          |                                    |     |       |
|------------+-------------+----------+------------------------------------+-----+-------|
#+end_example

** Time Series Experiment

#+begin_src python :var figname="pi_chart.png" :results output  :exports results
import sqlite3
import functools

con = sqlite3.connect("./billing.db")
cur = con.cursor()

def flatten_list (a):
  return functools.reduce(lambda x, y:x + '''", "''' + y,a)

# a list of super-projects to plot
labels = 'L0MDT', 'ETL', 'APOLLO', 'GEX1', 'ME0', 'OTHER'

# a lookup between "superprojects" and the constituent projects that should be plotted
lookups = {
  'L0MDT': ("L0MDT",),
  'ETL': ("ETL",),
  'GEX1': ("GE11", "GE21"),
  'GE21': ("GE21",),
  'CSC': ("CSC",),
  'GE11': ("GE11",),
  'ME0': ("ME0",),
  'APOLLO': ("Tracker", "APOLLO", "CMS-PIXEL-DTC"),
  'CMS-MUON': ("CSC", "GE11", "ME0", "GE21"),
  'OTHER': ("VACATION", "HOLIDAY", "ADMIN", "SICK", "DEVEL", "--")
}

not_other = [v if k!="OTHER" else () for (k,v) in lookups.items()]
not_other = tuple([j for i in not_other for j in i])
lookups["OTHER"] = not_other + lookups["OTHER"]

dates = [
  cur.execute('''select Date from hours where Project %s ("%s")'''
              % ("NOT in" if label=="OTHER" else "in",
                 flatten_list(lookups[label]))).fetchall()[0][0]
         for label in labels]
hours = [
  cur.execute('''select Hours from hours where Project %s ("%s")'''
              % ("NOT in" if label=="OTHER" else "in",
                 flatten_list(lookups[label]))).fetchall()[0][0]
         for label in labels]

###############################################################################
# plot
###############################################################################

import matplotlib.pyplot as plt

plt.xkcd()
plt.rcParams['font.sans-serif'] = ['Consolas']
plt.rcParams['font.size'] = 14

# print(hours)
# print(dates)

# Create data
x=range(1,6)
y1=[1,4,6,8,9]
y2=[2,2,7,10,12]
y3=[2,8,5,10,6]

# Basic stacked area chart.
plt.stackplot(x,y1, y2, y3, labels=['A','B','C'])
plt.legend(loc='upper left')

print(cur.execute('''select SUM(Hours) from hours where Project in ("L0MDT") and strftime('%m', Date)="01" and strftime('%Y',Date)="2022"''').fetchall())


# plt.stackplot(x, y, labels=t)
# plt.legend(bbox_to_anchor=(1.48, 0.9), loc='upper right', prop=fontP)
# plt.savefig(figname, bbox_inches="tight")


#plt.style.use("seaborn")

# fig1, ax1 = plt.subplots()
# ax1.pie(sizes, labels=labels, autopct='%1.1f%%',
#         shadow=True, startangle=90)
# ax1.axis('equal')  # Equal aspect ratio ensures that pie is drawn as a circle.

# # # plt.show()
# plt.savefig(figname, bbox_inches="tight")
# return(figname)
#+end_src

#+RESULTS:
: [(70.0,)]

**** Elisp
#+begin_src elisp
(defvar db (emacsql-sqlite "~/company.db"))

;; Create a table. Table and column identifiers are symbols.
;; (emacsql db [:create-table people ([name id salary])])

;; Insert some data:
(emacsql db [:insert :into people
             :values (["Jeff" 1000 60000.0] ["Susan" 1001 64000.0])])

;; Query the database for results:
(emacsql db [:select [name id]
             :from people
             :where (> salary 62000)])
;; => (("Susan" 1001))

;; Queries can be templates, using $1, $2, etc.:
(emacsql db [:select [name id]
             :from people
             :where (> salary $s1)]
         50000)
;; => (("Jeff" 1000) ("Susan" 1001))
#+end_src

#+RESULTS:
| Jeff  | 1000 |
| Susan | 1001 |
| Jeff  | 1000 |
| Susan | 1001 |
| Jeff  | 1000 |
| Susan | 1001 |

#+begin_src elisp
;; https://github.com/skeeto/emacsql
(defvar db (emacsql-sqlite "~/Sync/notes/billing/billing.db"))
(emacsql db [tables])
;; (emacsql db [:select [Date Task Hours]
;;              :from hours
;;              ;; :where (= Project 'L0MDT)
;;              ]
;;          50000)
(emacsql-show-last-sql)
#+end_src

**** R
#+begin_src R :results output
## library(sqldf)
library(RSQLite)
library(dplyr)

con <- dbConnect(RSQLite::SQLite(), "billing.db")

dbListTables(con)

data <- filter(data.frame(tbl(con, "hours")), Project!="Project")
data <- filter(data, Project=="L0MDT")
str(data)
## print(data[6])
## pie (data$Project)
#+end_src

#+RESULTS:
: [1] "hours"
: 'data.frame':	44 obs. of  6 variables:
:  $ Date   : chr  "2022-01-04" "2022-01-05" "2022-01-06" "2022-01-06" ...
:  $ Time   : chr  "12-4:30" "12-4" "10:30-12:30" "12:30-1:30" ...
:  $ Project: chr  "L0MDT" "L0MDT" "L0MDT" "L0MDT" ...
:  $ Task   : chr  "Timing; Felix TX" "Firmware" "Firmware" "PDR" ...
:  $ Weekday: chr  "TUE" "WED" "THU" "THU" ...
:  $ Hours  : chr  "4.5" "4.0" "2.0" "1.0" ...

***** Totals Project / Non-project
#+begin_src sqlite :db billing.db
select SUM(Hours),Project from hours where PROJECT not in ("DEVEL", "SICK", "ADMIN", "VACATION", "HOLIDAY", "--");
select SUM(Hours),Project from hours where PROJECT in ("DEVEL", "SICK", "ADMIN", "VACATION", "HOLIDAY", "--");
#+end_src
#+RESULTS:
| 1665.25 | Project |
|   473.5 | HOLIDAY |
